Revit 2026 API

# DisplayingOptionsDialogEventArgs Properties

---

The DisplayingOptionsDialogEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | PagesCount | The count of pages in the options dialog (include the default pages added by Revit). |

#### Reference

DisplayingOptionsDialogEventArgs Class

Autodesk.Revit.UI.Events Namespace